### Pandas iloc and loc

In [1]:
import pandas as pd;
import numpy as np;

In [2]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]
df =  pd.DataFrame(mydict);

In [3]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [4]:
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [5]:
df.iloc[:, 0]

0       1
1     100
2    1000
Name: a, dtype: int64

In [6]:
df.iloc[0,0]

1

In [22]:
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [23]:
df.iloc[[0],[1,2]]

   b  c
0  2  3

In [24]:
df.iloc[0:2]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [25]:
df.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

In [42]:
df.iloc[slice(0,2)]    ## slice(start , stop , step)

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [43]:
df.iloc[slice(0,2), slice(0,2)]

     a    b
0    1    2
1  100  200

In [45]:
df.iloc[[True, True, False]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [48]:
df.iloc[[True, True, False], [True, False, True, False]]

     a    c
0    1    3
1  100  300

In [52]:
df.iloc[lambda x: x.index%2==0, :]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [62]:
df.iloc[(lambda x: x.index==0), slice(0,3)]

   a  b  c
0  1  2  3

In [63]:
df.values   # numpy representation of dataframe

array([[   1,    2,    3,    4],
       [ 100,  200,  300,  400],
       [1000, 2000, 3000, 4000]], dtype=int64)

In [64]:
df.dtypes

a    int64
b    int64
c    int64
d    int64
dtype: object

In [66]:
list(df.index)

[0, 1, 2]

In [67]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 224.0 bytes

In [70]:
df.select_dtypes(include=[np.integer])

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [73]:
df.select_dtypes(include=[object])

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [75]:
df.select_dtypes(np.number)

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [76]:
df.select_dtypes('number')

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [77]:
df.ndim

2

In [78]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['a', 'b', 'c', 'd'], dtype='object')]

In [79]:
df.size

12

In [80]:
df.shape

(3, 4)

### loc

In [81]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
                  index=['cobra', 'viper', 'sidewinder'],
                  columns=['max_speed', 'shield'])

In [85]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [86]:
df.loc['cobra']

max_speed    1
shield       2
Name: cobra, dtype: int64

In [87]:
df.loc['cobra':]

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [88]:
df.loc[['cobra','sidewinder'], ['max_speed']]

            max_speed
cobra               1
sidewinder          7

In [89]:
df.iloc[lambda x: x.index=='cobra']

       max_speed  shield
cobra          1       2

In [93]:
df.loc[df['max_speed']<2]

       max_speed  shield
cobra          1       2

In [94]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [95]:
df.loc[df['shield']>6]

            max_speed  shield
sidewinder          7       8

In [98]:
df.loc[df['shield'] == 8, 'shield'] = 0

In [99]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       0

In [101]:
list(df.items())

[('max_speed',
  cobra         1
  viper         4
  sidewinder    7
  Name: max_speed, dtype: int64),
 ('shield',
  cobra         2
  viper         5
  sidewinder    0
  Name: shield, dtype: int64)]

In [110]:
for label, content in df.items():
    print('Label', label);
    print('Content','\n', content);

Label max_speed
Content
 cobra         1
viper         4
sidewinder    7
Name: max_speed, dtype: int64
Label shield
Content
 cobra         2
viper         5
sidewinder    0
Name: shield, dtype: int64